In [33]:
import pandas as pd

In [34]:
df = pd.read_csv("supershop.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [36]:
x = df.drop('Profit', axis=1)
y = df['Profit']

In [5]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [37]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [38]:
x2 = x.copy()

In [40]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [61]:
x3 = x2.copy()

In [62]:
x4 = x3.copy()

In [63]:
x5 = x4.copy()

In [65]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [41]:
from sklearn.preprocessing import MinMaxScaler

In [42]:
m = MinMaxScaler() #feature range(0,1) by default

In [43]:
#df_mar_sp = m.fit(x[['Marketing Spend']])  #calculating

In [44]:
#df_mar_sp

In [45]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [46]:
#x['Marketing Spend'] = m.transform(x[['Marketing Spend']])

In [47]:
#x['Marketing Spend'].head()

In [59]:
for column in x.columns:
    if pd.api.types.is_numeric_dtype(x[column]):
       x[[column]] = m.fit_transform(x[[column]])
    else:
        continue

In [60]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standardization

In [70]:
from sklearn.preprocessing import StandardScaler
m2 = StandardScaler()

In [73]:
for column in x2.columns:
    if pd.api.types.is_numeric_dtype(x2[column]):
        x2[[column]] = m2.fit_transform(x2[[column]])
    else:
        continue

In [74]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [76]:
x2['Marketing Spend'].std()

1.0101525445522108

# Log Transformation

In [77]:
import numpy as np

In [78]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [83]:
for column in x3.columns:
    if np.issubdtype(x3[column].dtype, np.number):
        x3[[column]] = np.log(x3[[column]])
    else:
        continue

C:\Users\Md Monjurul Islam\anaconda3\Lib\site-packages\pandas\core\internals\blocks.py:351: RuntimeWarning: invalid value encountered in log
  result = func(self.values, **kwargs)
C:\Users\Md Monjurul Islam\anaconda3\Lib\site-packages\pandas\core\internals\blocks.py:351: RuntimeWarning: invalid value encountered in log
  result = func(self.values, **kwargs)

In [84]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0         2.455181        2.470384   2.569882    Dhaka
1         2.484826        2.478849   2.565207      Ctg
2         2.479984        2.444459   2.558688  Rangpur
3         2.474869        2.458230   2.553835    Dhaka
4         2.473537        2.435621   2.550292  Rangpur

# Max Absolute Scaler

In [85]:
from sklearn.preprocessing import MaxAbsScaler
m3 = MaxAbsScaler()

In [86]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [88]:
for column in x4.columns:
    if pd.api.types.is_numeric_dtype(x4[column]):
        x4[[column]] = m3.fit_transform(x4[[column]])
    else:
        continue

In [89]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

# Robust Scaler

In [90]:
from sklearn.preprocessing import RobustScaler
m4 = RobustScaler()

In [91]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [92]:
for column in x5.columns:
    if pd.api.types.is_numeric_dtype(x5[column]):
        x5[[column]] = m4.fit_transform(x5[[column]])
    else:
        continue

In [93]:
x5.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur